grammar/new-words.org
#+TITLE: New Vocabulary
This glossary contains new vocabulary items for the Middle Low German reading group. See the full glossary [[https://bedebok.github.io/grammar/glossary.html][here]].

#+ATTR_HTML: :border 2 :rules all :frame border
|----------------+----------------+-------+----------------------------|
| Form in text   | Lemma          | POS   | Definition                 |
|----------------+----------------+-------+----------------------------|
| astronomyen,   |                |       | astronomy                  |
| firmamenten,   |                |       | firmament                  |
| planeten,      |                |       | planet                     |
| teykenen,      |                |       |                            |
| sternen,       |                |       |                            |
| lepe           |                |       |                            |
| stonden,       |                |       |                            |
| ponten         |                |       |                            |
| vort           |                |       |                            |
| an             |                |       |                            |
| to             |                |       |                            |
| tellende       |                |       |                            |
| gheistlyk      |                |       | spiritual                  |
| lichamlyk      |                |       | bodily                     |
| wetenheit      | wetenheit      | f     | knowledge; wisdom          |
| ghevil         | gevallen       | v     | occur                      |
| upp            | up             | prep  | on, at                     |
| vorbenomeden   | vorbenomet     | adj   | aforementioned             |
| mechtigh       | mechtig        | adj   | mighty                     |
| liet           | laten          | v     | let                        |
| soken          | soken          | v     | seek                       |
| eer            | er             | adv   | before                     |
| umme           | umme           | prep  | about                      |
| profyt,        | profit         | m/n   | benefit, profit            |
| doende,        | don            | v     | do                         |
| ghi            | gi             | pron  | you (pl)                   |
| vragede        | vragen         | v     | ask                        |
| wysen          | wis            | adj   | wise                       |
| philosophus    | philosophus    | m     | philosopher                |
| vele           | vel            | adj   | many                       |
| vraghe,        | vrage          | f     | question                   |
| begherde       | begeren        | v     | covet, desire              |
| nemant         | nemant         | pron  | nobody                     |
| berichtende    | berichten      | v     | report, inform             |
| Men            | men            | conj  | but                        |
| to rechte      | to rechte      | adv   | rightly                    |
| bescheydeliken | bescheideliken | adj   | prudent                    |
| behagede       | behagen        | v     | please                     |
| maken          | maken          | v     | make                       |
| namen          | name           | m     | name                       |
| gink           | gan            | v     | go                         |
| dode           | dod            | m     | death                      |
| to lesten      | to lesten      | adv   | finally                    |
| onder          | onder          | prep  | under                      |
| macht          | macht          | f     | might, power, authority    |
| Caldea         | Caldea         | prop  | Chaldea (Babylonia)        |
| rade           | rad            | m     | advice                     |
| duvels,        | duvel          | m     | devil                      |
| vorbernen      | vorbernen      | v     | burn                       |
| steden,        | steden         | v     | place, allow               |
| vorloren       | vorloren       | adj   | lost                       |
| vorloren       | vorlesen       | v     | lose                       |
| hande          | hand           | f     | hand                       |
| Madyan.3       | Madyan         | prop  | Madyan                     |
| uthsetischen   | utsetich       | adj   | outcast, leperous          |
| Naaman         | Naaman         | prop  | Naman                      |
| ridderen       | ridder         | m     | knight                     |
| Syrien4        | Syrien         | prop  | Syria                      |
| gheboren       | beren          | v     | bear                       |
| gheboren       | geboren        | adj   | born                       |
| sere           | sere           | adv   | very                       |
| werdichliken.  | werdichlik     | adj   | worthy, valuable           |
| ghenas         | genesen        | v     | heal                       |
| spittale       | spetal         | n/m   | hospital                   |
| Jordane.       | Jordan         | prop  | Jordan (river)             |
| langhen        | lang           | adj   | long                       |
| stonden        | stunde         | f     | time                       |
| wart           | werden         | v     | become                     |
| wedder         | wedder         | adv   | again                      |
| to kumpst      | tokumpst       | f     | coming                     |
| leven          | lief, lef      | adj   | beloved                    |
| Darumme        | darumme        | adv   | therefore, for that reason |
| greven,        | greve          | m     | count (nobleman)           |
| ertzebisschopp | ersebischop    | m     | archbishop                 |
| Sabach,        | Sabach         | prop  | Sabah                      |
| eyne wyle      | ene wile       | adv   | for a time                 |
| olden          | old            | adj   | old                        |
| Samarya.       | Samaria        | prop  | Samaria                    |
| klerck,        | klerk          | m     | cleric                     |
| Dimittere      | Dimittere      | prop  | Dimittere                  |
| cristen        | kristen        | adj   | Christian                  |
| ghesant        | senden         | v     | send                       |
| Yspanyen       | Yspania        | prop  | Spain                      |
| prediken       | prediken       | v     | preach                     |
| gheloven       | gelove         | m     | faith                      |
| droch          | dragen         | v     | drag, bring                |
| ghemartelt     | martelen       | v     | martyr                     |
| Tollen.7       | Tolle          | prop  | Toledo                     |
| priesterschopp | presterschop   | f     | priesthood                 |
| vonden         | vinden         | v     | find                       |
| satten ... ut  | utsetten       | v     | translate                  |
| Grekeschen     | grekisch       | adj   | Greek                      |
| Latyne.        | latin          | adj/n | Latin                      |
| ghewan         | gewinnen       | v     | acquire                    |
| langhe         | lange          | adv   | long                       |
| werdicheit     | werdicheit     | f     | esteem, value              |
| schonen        | schon          | adj   | beautiful                  |
|----------------+----------------+-------+----------------------------|
