grammar/new-words.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-22 Fri 12:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>New Vocabulary</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Seán Vrieland" />
</head>
<body>
<div id="content">
<h1 class="title">New Vocabulary</h1>
<p>
This glossary contains new vocabulary items for the Middle Low German reading group. See the full glossary <a href="https://bedebok.github.io/grammar/glossary.html">here</a>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Form in text</th>
<th scope="col" class="org-left">Lemma</th>
<th scope="col" class="org-left">POS</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">astronomyen,</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">astronomy</td>
</tr>

<tr>
<td class="org-left">firmamenten,</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">firmament</td>
</tr>

<tr>
<td class="org-left">planeten,</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">planet</td>
</tr>

<tr>
<td class="org-left">teykenen,</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sternen,</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lepe</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">stonden,</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ponten</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">vort</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">an</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">to</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tellende</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">gheistlyk</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">spiritual</td>
</tr>

<tr>
<td class="org-left">lichamlyk</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">bodily</td>
</tr>

<tr>
<td class="org-left">wetenheit</td>
<td class="org-left">wetenheit</td>
<td class="org-left">f</td>
<td class="org-left">knowledge; wisdom</td>
</tr>

<tr>
<td class="org-left">ghevil</td>
<td class="org-left">gevallen</td>
<td class="org-left">v</td>
<td class="org-left">occur</td>
</tr>

<tr>
<td class="org-left">upp</td>
<td class="org-left">up</td>
<td class="org-left">prep</td>
<td class="org-left">on, at</td>
</tr>

<tr>
<td class="org-left">vorbenomeden</td>
<td class="org-left">vorbenomet</td>
<td class="org-left">adj</td>
<td class="org-left">aforementioned</td>
</tr>

<tr>
<td class="org-left">mechtigh</td>
<td class="org-left">mechtig</td>
<td class="org-left">adj</td>
<td class="org-left">mighty</td>
</tr>

<tr>
<td class="org-left">liet</td>
<td class="org-left">laten</td>
<td class="org-left">v</td>
<td class="org-left">let</td>
</tr>

<tr>
<td class="org-left">soken</td>
<td class="org-left">soken</td>
<td class="org-left">v</td>
<td class="org-left">seek</td>
</tr>

<tr>
<td class="org-left">eer</td>
<td class="org-left">er</td>
<td class="org-left">adv</td>
<td class="org-left">before</td>
</tr>

<tr>
<td class="org-left">umme</td>
<td class="org-left">umme</td>
<td class="org-left">prep</td>
<td class="org-left">about</td>
</tr>

<tr>
<td class="org-left">profyt,</td>
<td class="org-left">profit</td>
<td class="org-left">m/n</td>
<td class="org-left">benefit, profit</td>
</tr>

<tr>
<td class="org-left">doende,</td>
<td class="org-left">don</td>
<td class="org-left">v</td>
<td class="org-left">do</td>
</tr>

<tr>
<td class="org-left">ghi</td>
<td class="org-left">gi</td>
<td class="org-left">pron</td>
<td class="org-left">you (pl)</td>
</tr>

<tr>
<td class="org-left">vragede</td>
<td class="org-left">vragen</td>
<td class="org-left">v</td>
<td class="org-left">ask</td>
</tr>

<tr>
<td class="org-left">wysen</td>
<td class="org-left">wis</td>
<td class="org-left">adj</td>
<td class="org-left">wise</td>
</tr>

<tr>
<td class="org-left">philosophus</td>
<td class="org-left">philosophus</td>
<td class="org-left">m</td>
<td class="org-left">philosopher</td>
</tr>

<tr>
<td class="org-left">vele</td>
<td class="org-left">vel</td>
<td class="org-left">adj</td>
<td class="org-left">many</td>
</tr>

<tr>
<td class="org-left">vraghe,</td>
<td class="org-left">vrage</td>
<td class="org-left">f</td>
<td class="org-left">question</td>
</tr>

<tr>
<td class="org-left">begherde</td>
<td class="org-left">begeren</td>
<td class="org-left">v</td>
<td class="org-left">covet, desire</td>
</tr>

<tr>
<td class="org-left">nemant</td>
<td class="org-left">nemant</td>
<td class="org-left">pron</td>
<td class="org-left">nobody</td>
</tr>

<tr>
<td class="org-left">berichtende</td>
<td class="org-left">berichten</td>
<td class="org-left">v</td>
<td class="org-left">report, inform</td>
</tr>

<tr>
<td class="org-left">Men</td>
<td class="org-left">men</td>
<td class="org-left">conj</td>
<td class="org-left">but</td>
</tr>

<tr>
<td class="org-left">to rechte</td>
<td class="org-left">to rechte</td>
<td class="org-left">adv</td>
<td class="org-left">rightly</td>
</tr>

<tr>
<td class="org-left">bescheydeliken</td>
<td class="org-left">bescheideliken</td>
<td class="org-left">adj</td>
<td class="org-left">prudent</td>
</tr>

<tr>
<td class="org-left">behagede</td>
<td class="org-left">behagen</td>
<td class="org-left">v</td>
<td class="org-left">please</td>
</tr>

<tr>
<td class="org-left">maken</td>
<td class="org-left">maken</td>
<td class="org-left">v</td>
<td class="org-left">make</td>
</tr>

<tr>
<td class="org-left">namen</td>
<td class="org-left">name</td>
<td class="org-left">m</td>
<td class="org-left">name</td>
</tr>

<tr>
<td class="org-left">gink</td>
<td class="org-left">gan</td>
<td class="org-left">v</td>
<td class="org-left">go</td>
</tr>

<tr>
<td class="org-left">dode</td>
<td class="org-left">dod</td>
<td class="org-left">m</td>
<td class="org-left">death</td>
</tr>

<tr>
<td class="org-left">to lesten</td>
<td class="org-left">to lesten</td>
<td class="org-left">adv</td>
<td class="org-left">finally</td>
</tr>

<tr>
<td class="org-left">onder</td>
<td class="org-left">onder</td>
<td class="org-left">prep</td>
<td class="org-left">under</td>
</tr>

<tr>
<td class="org-left">macht</td>
<td class="org-left">macht</td>
<td class="org-left">f</td>
<td class="org-left">might, power, authority</td>
</tr>

<tr>
<td class="org-left">Caldea</td>
<td class="org-left">Caldea</td>
<td class="org-left">prop</td>
<td class="org-left">Chaldea (Babylonia)</td>
</tr>

<tr>
<td class="org-left">rade</td>
<td class="org-left">rad</td>
<td class="org-left">m</td>
<td class="org-left">advice</td>
</tr>

<tr>
<td class="org-left">duvels,</td>
<td class="org-left">duvel</td>
<td class="org-left">m</td>
<td class="org-left">devil</td>
</tr>

<tr>
<td class="org-left">vorbernen</td>
<td class="org-left">vorbernen</td>
<td class="org-left">v</td>
<td class="org-left">burn</td>
</tr>

<tr>
<td class="org-left">steden,</td>
<td class="org-left">steden</td>
<td class="org-left">v</td>
<td class="org-left">place, allow</td>
</tr>

<tr>
<td class="org-left">vorloren</td>
<td class="org-left">vorloren</td>
<td class="org-left">adj</td>
<td class="org-left">lost</td>
</tr>

<tr>
<td class="org-left">vorloren</td>
<td class="org-left">vorlesen</td>
<td class="org-left">v</td>
<td class="org-left">lose</td>
</tr>

<tr>
<td class="org-left">hande</td>
<td class="org-left">hand</td>
<td class="org-left">f</td>
<td class="org-left">hand</td>
</tr>

<tr>
<td class="org-left">Madyan.3</td>
<td class="org-left">Madyan</td>
<td class="org-left">prop</td>
<td class="org-left">Madyan</td>
</tr>

<tr>
<td class="org-left">uthsetischen</td>
<td class="org-left">utsetich</td>
<td class="org-left">adj</td>
<td class="org-left">outcast, leperous</td>
</tr>

<tr>
<td class="org-left">Naaman</td>
<td class="org-left">Naaman</td>
<td class="org-left">prop</td>
<td class="org-left">Naman</td>
</tr>

<tr>
<td class="org-left">ridderen</td>
<td class="org-left">ridder</td>
<td class="org-left">m</td>
<td class="org-left">knight</td>
</tr>

<tr>
<td class="org-left">Syrien4</td>
<td class="org-left">Syrien</td>
<td class="org-left">prop</td>
<td class="org-left">Syria</td>
</tr>

<tr>
<td class="org-left">gheboren</td>
<td class="org-left">beren</td>
<td class="org-left">v</td>
<td class="org-left">bear</td>
</tr>

<tr>
<td class="org-left">gheboren</td>
<td class="org-left">geboren</td>
<td class="org-left">adj</td>
<td class="org-left">born</td>
</tr>

<tr>
<td class="org-left">sere</td>
<td class="org-left">sere</td>
<td class="org-left">adv</td>
<td class="org-left">very</td>
</tr>

<tr>
<td class="org-left">werdichliken.</td>
<td class="org-left">werdichlik</td>
<td class="org-left">adj</td>
<td class="org-left">worthy, valuable</td>
</tr>

<tr>
<td class="org-left">ghenas</td>
<td class="org-left">genesen</td>
<td class="org-left">v</td>
<td class="org-left">heal</td>
</tr>

<tr>
<td class="org-left">spittale</td>
<td class="org-left">spetal</td>
<td class="org-left">n/m</td>
<td class="org-left">hospital</td>
</tr>

<tr>
<td class="org-left">Jordane.</td>
<td class="org-left">Jordan</td>
<td class="org-left">prop</td>
<td class="org-left">Jordan (river)</td>
</tr>

<tr>
<td class="org-left">langhen</td>
<td class="org-left">lang</td>
<td class="org-left">adj</td>
<td class="org-left">long</td>
</tr>

<tr>
<td class="org-left">stonden</td>
<td class="org-left">stunde</td>
<td class="org-left">f</td>
<td class="org-left">time</td>
</tr>

<tr>
<td class="org-left">wart</td>
<td class="org-left">werden</td>
<td class="org-left">v</td>
<td class="org-left">become</td>
</tr>

<tr>
<td class="org-left">wedder</td>
<td class="org-left">wedder</td>
<td class="org-left">adv</td>
<td class="org-left">again</td>
</tr>

<tr>
<td class="org-left">to kumpst</td>
<td class="org-left">tokumpst</td>
<td class="org-left">f</td>
<td class="org-left">coming</td>
</tr>

<tr>
<td class="org-left">leven</td>
<td class="org-left">lief, lef</td>
<td class="org-left">adj</td>
<td class="org-left">beloved</td>
</tr>

<tr>
<td class="org-left">Darumme</td>
<td class="org-left">darumme</td>
<td class="org-left">adv</td>
<td class="org-left">therefore, for that reason</td>
</tr>

<tr>
<td class="org-left">greven,</td>
<td class="org-left">greve</td>
<td class="org-left">m</td>
<td class="org-left">count (nobleman)</td>
</tr>

<tr>
<td class="org-left">ertzebisschopp</td>
<td class="org-left">ersebischop</td>
<td class="org-left">m</td>
<td class="org-left">archbishop</td>
</tr>

<tr>
<td class="org-left">Sabach,</td>
<td class="org-left">Sabach</td>
<td class="org-left">prop</td>
<td class="org-left">Sabah</td>
</tr>

<tr>
<td class="org-left">eyne wyle</td>
<td class="org-left">ene wile</td>
<td class="org-left">adv</td>
<td class="org-left">for a time</td>
</tr>

<tr>
<td class="org-left">olden</td>
<td class="org-left">old</td>
<td class="org-left">adj</td>
<td class="org-left">old</td>
</tr>

<tr>
<td class="org-left">Samarya.</td>
<td class="org-left">Samaria</td>
<td class="org-left">prop</td>
<td class="org-left">Samaria</td>
</tr>

<tr>
<td class="org-left">klerck,</td>
<td class="org-left">klerk</td>
<td class="org-left">m</td>
<td class="org-left">cleric</td>
</tr>

<tr>
<td class="org-left">Dimittere</td>
<td class="org-left">Dimittere</td>
<td class="org-left">prop</td>
<td class="org-left">Dimittere</td>
</tr>

<tr>
<td class="org-left">cristen</td>
<td class="org-left">kristen</td>
<td class="org-left">adj</td>
<td class="org-left">Christian</td>
</tr>

<tr>
<td class="org-left">ghesant</td>
<td class="org-left">senden</td>
<td class="org-left">v</td>
<td class="org-left">send</td>
</tr>

<tr>
<td class="org-left">Yspanyen</td>
<td class="org-left">Yspania</td>
<td class="org-left">prop</td>
<td class="org-left">Spain</td>
</tr>

<tr>
<td class="org-left">prediken</td>
<td class="org-left">prediken</td>
<td class="org-left">v</td>
<td class="org-left">preach</td>
</tr>

<tr>
<td class="org-left">gheloven</td>
<td class="org-left">gelove</td>
<td class="org-left">m</td>
<td class="org-left">faith</td>
</tr>

<tr>
<td class="org-left">droch</td>
<td class="org-left">dragen</td>
<td class="org-left">v</td>
<td class="org-left">drag, bring</td>
</tr>

<tr>
<td class="org-left">ghemartelt</td>
<td class="org-left">martelen</td>
<td class="org-left">v</td>
<td class="org-left">martyr</td>
</tr>

<tr>
<td class="org-left">Tollen.7</td>
<td class="org-left">Tolle</td>
<td class="org-left">prop</td>
<td class="org-left">Toledo</td>
</tr>

<tr>
<td class="org-left">priesterschopp</td>
<td class="org-left">presterschop</td>
<td class="org-left">f</td>
<td class="org-left">priesthood</td>
</tr>

<tr>
<td class="org-left">vonden</td>
<td class="org-left">vinden</td>
<td class="org-left">v</td>
<td class="org-left">find</td>
</tr>

<tr>
<td class="org-left">satten &#x2026; ut</td>
<td class="org-left">utsetten</td>
<td class="org-left">v</td>
<td class="org-left">translate</td>
</tr>

<tr>
<td class="org-left">Grekeschen</td>
<td class="org-left">grekisch</td>
<td class="org-left">adj</td>
<td class="org-left">Greek</td>
</tr>

<tr>
<td class="org-left">Latyne.</td>
<td class="org-left">latin</td>
<td class="org-left">adj/n</td>
<td class="org-left">Latin</td>
</tr>

<tr>
<td class="org-left">ghewan</td>
<td class="org-left">gewinnen</td>
<td class="org-left">v</td>
<td class="org-left">acquire</td>
</tr>

<tr>
<td class="org-left">langhe</td>
<td class="org-left">lange</td>
<td class="org-left">adv</td>
<td class="org-left">long</td>
</tr>

<tr>
<td class="org-left">werdicheit</td>
<td class="org-left">werdicheit</td>
<td class="org-left">f</td>
<td class="org-left">esteem, value</td>
</tr>

<tr>
<td class="org-left">schonen</td>
<td class="org-left">schon</td>
<td class="org-left">adj</td>
<td class="org-left">beautiful</td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="author">Author: Seán Vrieland</p>
<p class="date">Created: 2023-09-22 Fri 12:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
